* macosrec Homebrew recipe

This is the Homebrew recipe for [[https://github.com/xenodium/macosrec][macosrec]], a utility to take screenshots/videos/ocr of macOS windows/regions from the command line.

#+begin_src sh
  brew install xenodium/macosrec/macosrec
#+end_src

* Hashing
You can ignore this space. The following snippet is used to generate the recipe hash from via [[https://orgmode.org/worg/org-contrib/babel/][org babel]].

#+begin_src swift
  import CommonCrypto
  import Foundation

  func sha256HashForURL(_ url: URL) -> String? {
    guard let fileData = try? Data(contentsOf: url) else {
      return nil
    }

    var digest = [UInt8](repeating: 0, count: Int(CC_SHA256_DIGEST_LENGTH))
    fileData.withUnsafeBytes {
      _ = CC_SHA256($0.baseAddress, CC_LONG(fileData.count), &digest)
    }

    return digest.map { String(format: "%02x", $0) }.joined()
  }

  if let url = URL(string: "https://github.com/xenodium/macosrec/archive/refs/tags/macosrec-0.7.3.tar.gz") {
    if let shaHash = sha256HashForURL(url) {
      print("SHA-256 hash: \(shaHash)")
    } else {
      print("Failed to compute the SHA-256 hash.")
    }
  } else {
    print("Invalid URL")
  }
#+end_src

#+RESULTS:
: SHA-256 hash: 72ad4fd1a341236f62dc6c646c95325cfe1ddf5f66fad02544af045c30dac115
